#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.aws_ssm_parameter.db_password: Reading...
data.aws_vpc.vpc_prod: Reading...
data.aws_ssm_parameter.db_username: Reading...
data.aws_ssm_parameter.db_name: Reading...
data.aws_ssm_parameter.db_username: Read complete after 1s [id=laravel_DB_USERNAME]
data.aws_ssm_parameter.db_name: Read complete after 1s [id=laravel_DB_DATABASE]
data.aws_ssm_parameter.db_password: Read complete after 1s [id=laravel_DB_PASSWORD]
data.aws_vpc.vpc_prod: Read complete after 2s [id=vpc-a5f162c1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ansible_host.laravel-ansible-server will be created
  + resource "ansible_host" "laravel-ansible-server" {
      + groups    = [
          + "nginx",
        ]
      + id        = (known after apply)
      + name      = (known after apply)
      + variables = {
          + "ansible_python_interpreter"   = "/usr/bin/python3"
          + "ansible_ssh_private_key_file" = <<-EOT
                -----BEGIN RSA PRIVATE KEY-----
                MIIEpAIBAAKCAQEAmN5xu1mP13lDezUpDX6e22wYu6jgtq3+8xcMBiH0VYl9gJ2l
                rxdIX9mJhEpm3uDEVZ9zNd0NILrlt1pF5jFAFqFv9/A1kJJDgxCw1yNT7yv1D4iK
                AFrNtvesmwZBVcTaguC5fWhgJWG4gscnAcSPNZy+GfXoT6gSWl7ZotIjAWWUtZMc
                wme77K8yXvihWhs8loTzG2zaMAnHYMjnTLbjVRPtATC19aSMLdjyUBwvqkv1yGcU
                h+fhLKg0nUVNhgHDeha18RF/zoTDBwNJ7OXpfT6ZGXIf3iTu9imSpijwgTP/kOzT
                tp4EZ5fTAR1BxwDadPi8i8AhK9bN3XASgmxoaQIDAQABAoIBAQCTulvERo/YFird
                VQlALj4MI9FfAJtwToNTndET2BpL0xuCgFaN9v0NC6d2PYReHG3/pKBszBsUpyi5
                YLat9qhNdmNDAlJxTLeLYETVEyHYvu0KvtNF9npYN88I3SmkXiEgW1VF2OkZFu99
                CkIq1i3jDH81jUucNvrNdF3zmAkWHfWBiPzwFala0x2xtz3lQZMg81+Z/6ExalG6
                WNh/fO6CViCFaJqw6MptGoa27qd2qA4kb/O6oSgPGKgnacJGg530iVy82OqQ4mPa
                SEA2iSUECde0TTNG6zibZ0udN2hrTqT7QpP9Oc2olmBSsBQMUZ8oGoXerO1J5mY2
                jok2ohwBAoGBAOqnb8l4Fwkw9XmleeNo+F98Ru6ktLIzEPGepq+6pJ3JrZOS8xSE
                Z1thVjkQk/c8AXZ7pRtvi5sVSGVgDtgItqS6B03Y/ltNJEm9MKa7CMQcL2K8FZOB
                A/zfCDTr1G6EqI88nxGB0SOlQ7eiqdPadqrsFFXU2sjsUw7VUVzRMVuBAoGBAKbG
                aqJ3mMR7/tLclcWCxailTS9wKX8k8lKSjS0pJ/+De5VM6bQcYG2zt2fIA1V7//L6
                vhmZfqY4WujSSm6ubxrzNDR8w/rcMxcAWDg8p6Z4x3lHCH9+QH0A61OtU5Vl38jg
                Y7PK9kxQgIrYtBFvOiQ9/SSoPnYtPMYrmDy5ECDpAoGAdognxrx73m+1wEIfhQlU
                VV+AsTHP+SgkifjbOG9ukin7HU2grp+HWjicBm1iYQQVtRUWPPqmqashi9vvA5+7
                KxCxedh/+/zGtNz1g3N9JRsbsKNTvtPwAL9k9N6fy0gFoX082OobjAcCYvOvF84G
                HabtSsIf1ljSR+7nj5w4c4ECgYAgO1S8lZSm1LgJFKy1gXKmB1yFgI3kjsVug/hY
                9A1Q6p5l2nmIX7ubOBKIMjXCvbZXxXIcDHhXs6iOOqY8AeZjNQGv6zUNNKWDGoPy
                Sna0S79xhvLzgPkBr73LbEItK4U2k3dxdhZn5V8SdpNGk1KPUpOsFAAOYuvN+Prx
                MWsWkQKBgQCji0ErdaL8NPpMdrNxaPPKmvgaxcHd7E75B6sNX4ctBG0c/Rd/8mt8
                raZi9oXLkj7bBB4PK4XP/7JRPIc44m9Bef2t1a+8O+Rq+tIHAuphAXEPyTQDWH3r
                duTEff3PlGr+AaoLRi7/vPUuS89nQqGzhfG3j87Ume2wqp3MkvFT0Q==
                -----END RSA PRIVATE KEY-----
            EOT
          + "ansible_user"                 = "ubuntu"
        }
    }

  # aws_db_instance.laraveldb will be created
  + resource "aws_db_instance" "laraveldb" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (sensitive value)
      + db_subnet_group_name                  = "laraveldb"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.5"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "laraveldb"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "laraveldb"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = (sensitive value)
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_parameter_group.laraveldb will be created
  + resource "aws_db_parameter_group" "laraveldb" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "postgres14"
      + id          = (known after apply)
      + name        = "laraveldb"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
    }

  # aws_db_subnet_group.laraveldb will be created
  + resource "aws_db_subnet_group" "laraveldb" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "laraveldb"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-7bc7840d",
          + "subnet-f60195af",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "LaravelDB"
        }
      + tags_all                = {
          + "Name" = "LaravelDB"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_iam_instance_profile.laravel_checkin_instance_profile will be created
  + resource "aws_iam_instance_profile" "laravel_checkin_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "laravelChecinEC2InstanceProfile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "laravelCheckinEC2Role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.laravel_checkin_role will be created
  + resource "aws_iam_role" "laravel_checkin_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "laravelCheckinEC2Role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.laravel_checkin_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "laravel_checkin_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = "laravelCheckinEC2Role"
    }

  # aws_instance.server will be created
  + resource "aws_instance" "server" {
      + ami                                  = "ami-0310483fb2b488153"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "laravelChecinEC2InstanceProfile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "2021-10"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-7bc7840d"
      + tags                                 = {
          + "Name" = "laravel-server"
        }
      + tags_all                             = {
          + "Name" = "laravel-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_route53_record.subdomain will be created
  + resource "aws_route53_record" "subdomain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "test.ulearn.nz"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07594225H1Y6M776MSO"
    }

  # aws_route53_record.subdomain_www will be created
  + resource "aws_route53_record" "subdomain_www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.test.ulearn.nz"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07594225H1Y6M776MSO"
    }

  # aws_security_group.laravel_server_sg will be created
  + resource "aws_security_group" "laravel_server_sg" {
      + arn                    = (known after apply)
      + description            = "Laravel server security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "103.163.248.98/32",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "laravel-server_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "laravel-server_sg"
        }
      + tags_all               = {
          + "Name" = "laravel-server_sg"
        }
      + vpc_id                 = "vpc-a5f162c1"
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Laravel db security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "laravel-rds_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "laravel-rds_sg"
        }
      + tags_all               = {
          + "Name" = "laravel-rds_sg"
        }
      + vpc_id                 = "vpc-a5f162c1"
    }

  # aws_ssm_parameter.db_endpoint will be created
  + resource "aws_ssm_parameter" "db_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "laravel_DB_HOST"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + webserver_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @Big-Vi, Action: `pull_request`*